Repository: chaserli/brewgraph
Catalog: HomebrewLens/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %.0fm ago
zh_hans: %.0f分钟前

source: %.0fs ago
zh_hans: %.0f秒前

source: %@ dependents
zh_hans: %@ 个反向依赖

source: %@ external
zh_hans: %@ 个第三方 Tap 包

# %@ formulae, %@ casks
source: %1$@ formulae, %2$@ casks
zh_hans: %1$@ 个 Formula，%2$@ 个 Cask

# %@ formulae, %@ direct edges
source: %1$@ formulae, %2$@ direct edges
zh_hans: %1$@ 个 Formula，%2$@ 条直接依赖边

# %@ of %@ Packages
source: %1$@ of %2$@ Packages
zh_hans: 共 %2$@ 个包，筛选后 %1$@ 个

source: %@ outdated
zh_hans: %@ 个已过期

# %@ outdated, %@ unused dependencies
source: %1$@ outdated, %2$@ unused dependencies
zh_hans: %1$@ 个可更新，%2$@ 个未使用依赖

source: %@ reclaimable
zh_hans: 可回收 %@

source: %@ Scan Warnings
zh_hans: %@ 条扫描警告

source: %@ Warnings
zh_hans: %@ 条警告

# %@, %lld deps, %lld users, %@
source: %1$@, %2$lld deps, %3$lld users, %4$@
zh_hans: %1$@，%2$lld 个依赖，%3$lld 个使用者，%4$@

source: %lld formulae, %lld casks
zh_hans: %lld 个 Formula，%lld 个 Cask

source: %lld formulae, %lld direct edges
zh_hans: %lld 个 Formula，%lld 条直接依赖边

source: %lld issues reported
zh_hans: 报告 %lld 个问题

# %lld of %lld Packages
source: %1$lld of %2$lld Packages
zh_hans: 共 %2$lld 个包，筛选后 %1$lld 个

source: %lld outdated
zh_hans: %lld 个可更新

# %lld outdated, %lld unused dependencies
source: %1$lld outdated, %2$lld unused dependencies
zh_hans: %1$lld 个可更新，%2$lld 个未使用依赖

source: %lld packages depend on this
zh_hans: %lld 个软件包依赖它

source: %lld Scan Warnings
zh_hans: %lld 条扫描警告

source: %lld Warnings
zh_hans: %lld 条警告

source: +%lld more categories
zh_hans: 还有 %lld 个分类

source: 1 issue reported
zh_hans: 报告 1 个问题

source: 1 Scan Warning
zh_hans: 1 条扫描警告

source: 1 Warning
zh_hans: 1 条警告

source: A read-only inspector for your Homebrew installation. Browse installed formulae, explore dependency graphs, and discover maintenance insights.
zh_hans: 一个只读的 Homebrew 检查器。 浏览已安装的软件包，查看依赖图，并发现需要维护的项目。

source: About BrewGraph
zh_hans: 关于 BrewGraph

source: Additional issues reported by brew doctor.
zh_hans: brew doctor 报告的其他问题。

source: All
zh_hans: 全部

source: App language
zh_hans: 应用语言

source: Brew at %@
zh_hans: brew 路径：%@

source: BrewGraph does not install Homebrew. Install it separately, then refresh.
zh_hans: BrewGraph 不会安装 Homebrew。请先单独安装，然后刷新。

source: BrewGraph kept the successful scan data and recorded optional command problems.
zh_hans: BrewGraph 已保留成功扫描的数据，并记录了可选命令的问题。

source: Cache / Old Versions
zh_hans: 缓存 / 旧版本

source: Casks
zh_hans: Cask

source: Center selected package
zh_hans: 居中选中的包

source: Center Selection
zh_hans: 居中选中

source: Checking explicit environment paths, common prefixes, then the zsh fallback.
zh_hans: 正在检查显式环境路径、常见安装前缀，然后回退到 zsh。

source: Checking known brew locations
zh_hans: 正在检查已知的 brew 位置

source: Checking known brew locations.
zh_hans: 正在检查已知的 brew 位置。

source: Cleanup
zh_hans: 清理

source: Cleanup Dry Run
zh_hans: 清理预演

source: Config Issues
zh_hans: 配置问题

source: Copy command
zh_hans: 复制命令

source: Copy Commands
zh_hans: 复制命令

source: Copy Diagnostics
zh_hans: 复制诊断

source: Copy Warnings
zh_hans: 复制警告

source: Dashboard
zh_hans: 概览

source: Default view
zh_hans: 默认视图

source: dependencies
zh_hans: 依赖

source: Dependencies
zh_hans: 依赖

source: Dependency
zh_hans: 依赖

source: Dependency Centers
zh_hans: 依赖中心

source: Dependency Graph
zh_hans: 依赖图

source: Dependency Hubs
zh_hans: 依赖中心

source: Dependency-Only Packages
zh_hans: 仅作为依赖安装的软件包

source: Depends on
zh_hans: 依赖

source: Depends On
zh_hans: 依赖

source: deprecated
zh_hans: 已弃用

source: Deprecated
zh_hans: 已弃用

source: Deprecated or outdated configuration detected.
zh_hans: 检测到过时或已弃用的配置。

source: deps
zh_hans: 依赖

source: Deps
zh_hans: 依赖

# Depth %@
source: Depth %1$@
zh_hans: 深度 %1$@

source: Depth %lld
zh_hans: 深度 %lld

source: Destructive example. Copy only.
zh_hans: 危险命令示例，仅可复制。

source: Destructive examples are copy-only
zh_hans: 危险命令示例仅可复制

source: Details
zh_hans: 详情

source: Diagnostics
zh_hans: 诊断

source: direct
zh_hans: 直接

source: direct dependencies
zh_hans: 直接依赖

source: Direct Dependency Fanout
zh_hans: 直接依赖最多

source: direct deps
zh_hans: 直接依赖

source: Direct Edges
zh_hans: 直接依赖边

source: direct formula dependency edges
zh_hans: Formula 的直接依赖边

source: direct installs vs dependency-only packages
zh_hans: 主动安装与依赖安装的对比

source: Directly installed
zh_hans: 主动安装

source: disabled
zh_hans: 已禁用

source: Disabled
zh_hans: 已禁用

source: Discovering Homebrew...
zh_hans: 正在查找 Homebrew...

source: Discovery checked Finder-safe paths and did not find an executable brew.
zh_hans: 已检查 Finder 启动时可用的安全路径，但没有找到可执行的 brew。

source: Done
zh_hans: 完成

source: dry run
zh_hans: 模拟运行

source: duration
zh_hans: 耗时

source: Edges
zh_hans: 依赖边

source: Error Details
zh_hans: 错误详情

source: Estimate cask app sizes
zh_hans: 估算 Cask 应用大小

source: Estimate formula sizes
zh_hans: 估算 Formula 大小

source: Estimating cask app sizes
zh_hans: 正在估算 Cask 应用大小

source: Estimating cask sizes
zh_hans: 正在估算 Cask 大小

source: Estimating cleanup hints
zh_hans: 正在估算清理提示

source: Estimating formula sizes
zh_hans: 正在估算 Formula 大小

source: Everything reported by Homebrew is current.
zh_hans: Homebrew 报告的内容都已是最新。

source: External Taps
zh_hans: 第三方 Tap

source: Files from previously removed packages remain on disk.
zh_hans: 之前已移除的包的残留文件仍在磁盘上。

source: Filter
zh_hans: 筛选

source: Finding Homebrew
zh_hans: 正在查找 Homebrew

source: Fit graph
zh_hans: 适应图

source: Fit Graph
zh_hans: 适应图

source: Flagged Packages
zh_hans: 带状态标记的包

source: formula dependency links
zh_hans: Formula 依赖关系

source: Formula relationships are ready.
zh_hans: Formula 依赖关系已就绪。

source: Formulae
zh_hans: Formula

source: Formulae currently installed for something else
zh_hans: 为其他软件包而安装的 Formula

source: formulae plus casks
zh_hans: Formula 与 Cask 合计

source: Formulae that keep the most installed packages working
zh_hans: 被最多已安装软件包依赖的 Formula

source: Formulae with no installed reverse dependents
zh_hans: 没有被其他已安装 Formula 依赖的 Formula

source: from enabled size estimation
zh_hans: 来自已启用的大小估算

source: Full Graph
zh_hans: 全局图

source: Graph Mode
zh_hans: 图模式

source: Graph ready
zh_hans: 图已就绪

source: Graph Shape
zh_hans: 图结构

source: Graph workspace
zh_hans: 图工作区

source: Hide inspector
zh_hans: 隐藏检查器

source: Highlights
zh_hans: 亮点

source: Homebrew not found
zh_hans: 未找到 Homebrew

source: Homebrew Not Found
zh_hans: 未找到 Homebrew

source: Homebrew Overview
zh_hans: Homebrew 总览

source: Homebrew was not found on this machine
zh_hans: 此设备上未找到 Homebrew

source: Homepage
zh_hans: 主页

source: How connected the formula graph is
zh_hans: Formula 依赖图的连接情况

source: indirect
zh_hans: 间接

source: Install
zh_hans: 安装

source: Install reason unknown
zh_hans: 安装原因未知

source: installed
zh_hans: 已安装

source: Installed
zh_hans: 安装时间

source: installed app casks
zh_hans: 已安装的 Cask 应用

source: Installed as dependency
zh_hans: 作为依赖安装

source: installed for other packages
zh_hans: 作为其他包的依赖安装

source: installed formula packages
zh_hans: 已安装的 Formula 包

source: installed on request
zh_hans: 主动安装

source: Installed on request
zh_hans: 主动安装

source: Installed Packages
zh_hans: 已安装软件包

source: Installed packages loaded, but no direct formula dependency edges were reported.
zh_hans: 已加载安装包，但未发现直接 formula 依赖关系。

source: Inventory Mix
zh_hans: 安装组成

source: Issues
zh_hans: 问题

source: Known Disk Use
zh_hans: 已知磁盘占用

source: Known Size
zh_hans: 已知大小

source: Language
zh_hans: 语言

source: Language changed
zh_hans: 语言已更改

source: Largest Known Packages
zh_hans: 已知最大软件包

source: Largest Packages
zh_hans: 最大包

source: Launch
zh_hans: 启动

source: Leaf Formulae
zh_hans: 叶子 Formula

source: leaves
zh_hans: 叶子节点

source: Leaves
zh_hans: 叶子节点

source: License
zh_hans: 许可证

source: Local Graph
zh_hans: 局部图

source: Local graph depth: %@
zh_hans: 局部图深度：%@

source: Local graph depth: %lld
zh_hans: 局部图深度：%lld

source: marked deprecated
zh_hans: 标记为废弃

source: marked disabled
zh_hans: 标记为禁用

source: Most Depended On
zh_hans: 被依赖最多

source: Name
zh_hans: 名称

source: Needs Attention
zh_hans: 需要关注

source: No brew executable was found.
zh_hans: 未找到 brew 可执行文件。

source: No dependency chain found
zh_hans: 未找到依赖链

source: No dependency-only leaves were found.
zh_hans: 没有发现仅作为依赖安装、且未被其他包使用的叶子节点。

source: No formula edges
zh_hans: 没有 Formula 依赖边

source: No package flags
zh_hans: 没有状态标记

source: No reclaimable cache or old-version data was reported.
zh_hans: 未报告可回收的缓存或旧版本数据。

source: No reclaimable size was reported.
zh_hans: 未报告可回收空间。

source: No scan yet
zh_hans: 尚未扫描

source: None
zh_hans: 无

source: not linked into default paths
zh_hans: 未链接到默认路径

source: nothing depends on them
zh_hans: 没有其他包依赖它们

source: OK
zh_hans: 确定

source: Only packages with a measured size are included
zh_hans: 仅包含已测得大小的软件包

source: Only the default Homebrew taps are present.
zh_hans: 当前只有 Homebrew 默认 Tap。

source: Other
zh_hans: 其他

source: Other tap
zh_hans: 第三方 Tap

source: Other Tap
zh_hans: 第三方 Tap

source: Other Taps
zh_hans: 第三方 Tap

source: outdated
zh_hans: 已过期

source: Outdated
zh_hans: 已过期

source: Outdated & Issues
zh_hans: 过期与问题

source: Outdated Packages
zh_hans: 可更新的软件包

source: Overview
zh_hans: 概览

source: Package Flags
zh_hans: 包状态

source: packages
zh_hans: 个包

source: Packages
zh_hans: 包

source: Packages from third-party taps are mixed in.
zh_hans: 当前包含来自第三方 Tap 的软件包。

source: Packages with the most direct formula dependencies
zh_hans: 直接 Formula 依赖最多的软件包

source: Packages with the most runtime dependency references
zh_hans: 运行时依赖引用最多的软件包

source: Permissions
zh_hans: 权限问题

source: Pinned
zh_hans: 已固定

source: Pinned, keg-only, deprecated, disabled, or outdated
zh_hans: 已固定、Keg-only、废弃、禁用或可更新的包

source: Read-only estimate of cache and old-version data. No packages are removed.
zh_hans: 只读估算缓存和旧版本数据；不会移除任何软件包。

source: Read-only estimate only. Nothing is executed from here.
zh_hans: 这里只显示只读估算，不会执行清理。

source: Read-only scan commands only
zh_hans: 仅限只读扫描命令

source: Reading cask list
zh_hans: 正在读取 Cask 列表

source: Reading direct dependency edges
zh_hans: 正在读取直接依赖边

source: Reading formula list
zh_hans: 正在读取 Formula 列表

source: Reading installed package metadata
zh_hans: 正在读取已安装包的元数据

source: Reading leaves and outdated packages
zh_hans: 正在读取叶子节点和可更新包

source: Ready to discover Homebrew
zh_hans: 准备查找 Homebrew

source: Ready to scan
zh_hans: 就绪，等待扫描

source: Reclaimable
zh_hans: 可回收

source: Refresh
zh_hans: 刷新

source: Refresh Homebrew
zh_hans: 刷新 Homebrew

source: reported by Homebrew
zh_hans: 由 Homebrew 报告

source: Requested
zh_hans: 主动安装

source: Requested Packages
zh_hans: 主动安装的软件包

source: Requested vs Dependency
zh_hans: 主动安装 / 依赖安装

source: Reset manual node positions
zh_hans: 重置手动节点位置

source: Reset Node Positions
zh_hans: 重置节点位置

source: Restart for new language
zh_hans: 重启后生效

source: Review dependency-only leaves before removing anything.
zh_hans: 移除任何内容前，请先检查这些仅作为依赖安装的叶子节点。

source: Run brew doctor
zh_hans: 运行 brew doctor

source: Run cleanup dry-run
zh_hans: 运行清理预演

source: Run read-only Homebrew scan
zh_hans: 运行只读 Homebrew 扫描

source: Running brew doctor
zh_hans: 运行 brew doctor

source: runtime dependencies
zh_hans: 运行时依赖

source: Runtime Dependencies
zh_hans: 运行时依赖

source: runtime dependency references
zh_hans: 运行时依赖引用

source: Runtime Dependency Users
zh_hans: 运行时依赖使用者

source: Runtime Links
zh_hans: 运行时依赖

source: Safety
zh_hans: 安全

source: Scan
zh_hans: 扫描

source: Scan complete
zh_hans: 扫描完成

source: Scan failed
zh_hans: 扫描失败

source: Scan Failed
zh_hans: 扫描失败

source: Scan on launch
zh_hans: 启动时扫描

source: Scan Warnings
zh_hans: 扫描警告

# Scanned %@ formulae, %@ casks, %@ edges from %@
source: Scanned %1$@ formulae, %2$@ casks, %3$@ edges from %4$@
zh_hans: 已从 %4$@ 扫描到 %1$@ 个 Formula、%2$@ 个 Cask、%3$@ 条依赖边

# Scanned %lld formulae, %lld casks, %lld edges from %@
source: Scanned %1$lld formulae, %2$lld casks, %3$lld edges from %4$@
zh_hans: 已从 %4$@ 扫描到 %1$lld 个 Formula、%2$lld 个 Cask、%3$lld 条依赖边

source: Scanned in %@
zh_hans: 扫描耗时 %@

source: Scanning
zh_hans: 正在扫描

source: Scanning Homebrew
zh_hans: 正在扫描 Homebrew

source: Search packages
zh_hans: 搜索软件包

source: Select a formula
zh_hans: 请选择一个 formula

source: Select the first outdated package.
zh_hans: 选择第一个可更新的软件包。

source: Selected
zh_hans: 已选中

source: Selected package neighborhood
zh_hans: 选中包的邻域

source: Show less
zh_hans: 收起

source: Show scan diagnostics
zh_hans: 显示扫描诊断

source: Size
zh_hans: 大小

source: Some Homebrew directories have incorrect permissions, which may prevent package installation.
zh_hans: 某些 Homebrew 目录权限不正确，可能导致无法安装包。

source: Sort
zh_hans: 排序

source: Sort by
zh_hans: 排序方式

source: Stable
zh_hans: 稳定版

source: Stale Files
zh_hans: 残留文件

source: Starting read-only scan
zh_hans: 开始只读扫描

source: States worth keeping visible
zh_hans: 值得持续关注的状态

source: Status
zh_hans: 状态

source: Summary workspace
zh_hans: 概览工作区

source: Switch to Chinese
zh_hans: 切换到中文

source: Switch to English
zh_hans: 切换到英文

source: Tap Origins
zh_hans: Tap 来源

source: Taps
zh_hans: Tap

source: The app checked the standard Finder-safe discovery paths and did not find an executable brew.
zh_hans: 应用已检查 Finder 启动时可用的标准路径，但没有找到可执行的 brew。

source: The language change will take effect after you restart BrewGraph.
zh_hans: 语言更改将在您重启 BrewGraph 后生效。

source: The scan stopped before a snapshot could be produced.
zh_hans: 扫描在生成快照前已停止。

source: These warnings usually mean one read-only supporting command failed or returned partial output.
zh_hans: 这些警告通常意味着某个只读辅助命令失败或返回了部分输出。

source: Things installed directly, not just pulled in
zh_hans: 主动安装的项目，而不是被依赖带入的项目

source: total
zh_hans: 总计

source: Unique
zh_hans: 唯一项

source: unknown
zh_hans: 未知

source: Unknown
zh_hans: 未知

source: Unused
zh_hans: 未使用

source: Unused Dependencies
zh_hans: 未使用依赖

source: Unused dependency
zh_hans: 未使用依赖

source: Unused Deps
zh_hans: 未使用依赖

source: Used by
zh_hans: 被依赖

source: Used By
zh_hans: 被依赖

source: used by 3+ packages
zh_hans: 被 3 个以上包依赖

source: users
zh_hans: 使用者

# Version %@ (%@)
source: Version %1$@ (%2$@)
zh_hans: 版本 %1$@ (%2$@)

source: View on GitHub
zh_hans: 在 GitHub 上查看

source: Waiting for read-only Homebrew data.
zh_hans: 等待只读 Homebrew 数据。

source: Warnings
zh_hans: 警告

source: What Homebrew currently has on disk
zh_hans: 当前 Homebrew 在磁盘上的安装内容

source: Where installed packages came from
zh_hans: 已安装软件包的来源

source: Why Installed
zh_hans: 安装原因

source: Xcode / CLT
zh_hans: Xcode / 命令行工具

source: Xcode or Command Line Tools may be outdated, which can cause build failures.
zh_hans: Xcode 或命令行工具可能过期，可能导致构建失败。

source: Zoom in
zh_hans: 放大

source: Zoom In
zh_hans: 放大

source: Zoom out
zh_hans: 缩小

source: Zoom Out
zh_hans: 缩小
